
## ABLATION 3

###     1- Not c2f-half repeats
##      2- SPPF remove
#       3- No P5 layer


nc: 2  # number of classes
scales:
  m: [0.67, 0.75, 768]

# Backbone (No P5)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 3, C2f, [128, True]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 6, C2f, [256, True]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 6, C2f, [512, True]]     # 6

# Head (no P5 path)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 7
  - [[-1, 4], 1, Concat, [1]]                     # 8: P4 + P3
  - [-1, 3, C2f, [256]]                           # 9: P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                    # 10: downsample
  - [[-1, 6], 1, Concat, [1]]                     # 11: P4
  - [-1, 3, C2f, [512]]                           # 12: P4/16-medium

  - [[9, 12], 1, Segment, [nc, 32, 256]]          # 13: Segment head (P3, P4 only)
