
## ABLATION 4

###     1- c2f-half repeats
##      2- SPPF remove
#       3- No P5 layer with P5 head
##      4- channel width reduce 64 -> 48, 128 -> 96, 256 -> 192, 512 -> 384 (No P5 channels)

nc: 2 

scales:
  m: [0.67, 0.75, 768]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [48, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [96, 3, 2]]        # 1-P2/4
  - [-1, 2, C2f, [96, 96, 2, True]]  # 2
  - [-1, 1, Conv, [192, 3, 2]]       # 3-P3/8
  - [-1, 2, C2f, [192, 192, 2, True]] # 4
  - [-1, 1, Conv, [384, 3, 2]]       # 5-P4/16
  - [-1, 2, C2f, [384, 384, 2, True]] # 6

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 7
  - [[-1, 4], 1, Concat, [1]]                     # 8: P4 + P3
  - [-1, 2, C2f, [192, 192, 2]]                   # 9: P3/8-small

  - [-1, 1, Conv, [192, 3, 2]]                    # 10: downsample
  - [[-1, 6], 1, Concat, [1]]                     # 11: P4
  - [-1, 2, C2f, [384, 384, 2]]                   # 12: P4/16-medium

  - [[9, 12], 1, Segment, [nc, 32, 128]]  # 13: Segment Head (P3, P4)
