# models/yolov8m-seg-lka_yolo.yaml
# 'LKA‑YOLO' style backbone using ResVAN blocks

nc: 2
scales:
  m: [0.67, 0.75, 768]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1 P2/4
  - [-1, 2, ResVANBlock, [128, 128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3 P3/8
  - [-1, 3, ResVANBlock, [256, 256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5 P4/16
  - [-1, 3, ResVANBlock, [512, 512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7 P5/32
  - [-1, 2, ResVANBlock, [1024, 1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, ResVANBlock, [1024, 512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, ResVANBlock, [512, 256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, ResVANBlock, [512, 512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, ResVANBlock, [2048, 1024, False]]

  - [[15, 18, 21], 1, Segment, [nc, 32, 256]]
